using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _3_2
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}

#region
//
// ** Задание 3.2
// Заказчику требуется приложение позволяющщее складывать и вычитать математические матрицы
// Справка https://ru.wikipedia.org/wiki/Матрица_(математика)
// Справка https://ru.wikipedia.org/wiki/Матрица_(математика)#Сложение_матриц
// Добавить возможность ввода количество строк и столцов матрицы.
// Матрицы заполняются автоматически
// Если по введённым пользователем данным действие произвести невозможно - сообщить об этом
//
// Пример
//  |  1  3  5  |   |  1  3  4  |   |  2   6   9  |
//  |  4  5  7  | + |  2  5  6  | = |  6  10  13  |
//  |  5  3  1  |   |  3  6  7  |   |  8   9   8  |
//  
//  
//  |  1  3  5  |   |  1  3  4  |   |  0   0   1  |
//  |  4  5  7  | - |  2  5  6  | = |  2   0   1  |
//  |  5  3  1  |   |  3  6  7  |   |  2  -3  -6  |
//
#endregion